<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Exploratory Data Analysis using SQL</font></h1>

Estimated time needed: **60** minutes.

## Introduction

Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Execute SQL queries to answer some questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones.

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage.

Therefore if we can determine if the first stage will land, we can determine the cost of a launch.

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

**We import our data to local sqlite db file**

***I recommended you to use DBMS like IBM db2 because it has date and time format detection***

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [1]:
%load_ext sql

Create sqlite db file with <code>connect</code> method

In [2]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [3]:
# !pip3 install pandas
# !pip3 install sql
# !pip3 install ipython-sql

connect to database

In [4]:
%sql sqlite:///my_data1.db

In [5]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
For Example "Landing_Outcome"**

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [6]:
# first we see what columns we have in our tabel

In [7]:
#sql lite syntax for reading columns of table
%sql PRAGMA table_info("SPACEXTBL");

 * sqlite:///my_data1.db
Done.

[(0, 'Date', 'TEXT', 0, None, 0),
 (1, 'Time (UTC)', 'TEXT', 0, None, 0),
 (2, 'Booster_Version', 'TEXT', 0, None, 0),
 (3, 'Launch_Site', 'TEXT', 0, None, 0),
 (4, 'Payload', 'TEXT', 0, None, 0),
 (5, 'PAYLOAD_MASS__KG_', 'INTEGER', 0, None, 0),
 (6, 'Orbit', 'TEXT', 0, None, 0),
 (7, 'Customer', 'TEXT', 0, None, 0),
 (8, 'Mission_Outcome', 'TEXT', 0, None, 0),
 (9, 'Landing _Outcome', 'TEXT', 0, None, 0)]

In [8]:
%sql select distinct("Launch_Site") from "SPACEXTBL"

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [9]:
%sql select * from "SPACEXTBL" where "Launch_Site" like 'CCA%' limit 5;

 * sqlite:///my_data1.db
Done.

[('04-06-2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('08-12-2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('22-05-2012', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('08-10-2012', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('01-03-2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [10]:
%sql select sum("PAYLOAD_MASS__KG_") from "SPACEXTBL" where "Customer" = 'NASA (CRS)'

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [11]:
%sql select avg("PAYLOAD_MASS__KG_") as "average_mass" from "SPACEXTBL" where "Booster_Version" = 'F9 v1.1'  ;

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.

**In this dataset file date format is incorrect and we can not use min function to retrive first succesful landing outcome**
as you can see in below:  
we have to find it by looking at dataset or reformating Date column in our data set or we can use <code>substr</code>.  
**In our dataset we should check it by substr**

In [12]:
%sql select count(*) as "First_Succesful_Landing" from "SPACEXTBL" where "Mission_Outcome" = 'Success';

 * sqlite:///my_data1.db
Done.

[(98,)]

##### As we see in previous cell's result, we have 98 records, so we use substr to get first successful landing outcome on ground pad

In [13]:
%sql select date from "SPACEXTBL" where "Mission_Outcome" = 'Success' and\
"Landing _Outcome" = 'Success (ground pad)' and\
substr(date,7,4)||substr(date,4,2)||substr(date,1,2) =\
(select min(substr(date,7,4)||substr(date,4,2)||substr(date,1,2)) as "min_date" from "SPACEXTBL" where "Mission_Outcome" = 'Success' and\
"Landing _Outcome" = 'Success (ground pad)')

 * sqlite:///my_data1.db
Done.

[('22-12-2015',)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [14]:
# %sql select "Landing _Outcome" from SPACEXTBL

In [15]:
%sql select "Booster_Version", "PAYLOAD_MASS__KG_" from "SPACEXTBL"\
where "Mission_Outcome" = 'Success' and "Landing _Outcome" = "Success (drone ship)" and "PAYLOAD_MASS__KG_" between 4000 and 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022', 4696),
 ('F9 FT B1026', 4600),
 ('F9 FT  B1021.2', 5300),
 ('F9 FT  B1031.2', 5200)]

### Task 7

##### List the total number of successful and failure mission outcomes

In [16]:
%sql select count("Mission_Outcome") as "Count" from "SPACEXTBL";

 * sqlite:///my_data1.db
Done.

[(101,)]

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass.

In [17]:
%sql select "Booster_Version" from "SPACEXTBL" where "PAYLOAD_MASS__KG_" = \
(select max("PAYLOAD_MASS__KG_") from "SPACEXTBL");

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Task 9

##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So we need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [18]:
# %sql select substr("Date",4,2) as "month", substr("Date",7,4) as "year", "Landing _Outcome", "Booster_Version", \
# "Launch_Site", "Mission_Outcome" from "SPACEXTBL" where "year" = '2015';

In [19]:
%sql select substr("Date",4,2) as "month", substr("Date",7,4) as "year", "Landing _Outcome", "Booster_Version", \
"Launch_Site", "Mission_Outcome" from "SPACEXTBL" where "year" = '2015' and "Landing _Outcome" like '%failure%';

 * sqlite:///my_data1.db
Done.

[('01', '2015', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40', 'Success'),
 ('04', '2015', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40', 'Success')]

### Task 10

##### Rank the  count of landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [20]:
%sql select date, "Landing _Outcome", count("Landing _Outcome") as "Count" from "SPACEXTBL" where\
substr(date,7,4)||substr(date,4,2)||substr(date,1,2) between '20100604' and '20170320'\
group by "Landing _Outcome" order by "Count" desc;

 * sqlite:///my_data1.db
Done.

[('22-05-2012', 'No attempt', 10),
 ('08-04-2016', 'Success (drone ship)', 5),
 ('10-01-2015', 'Failure (drone ship)', 5),
 ('22-12-2015', 'Success (ground pad)', 3),
 ('18-04-2014', 'Controlled (ocean)', 3),
 ('29-09-2013', 'Uncontrolled (ocean)', 2),
 ('04-06-2010', 'Failure (parachute)', 2),
 ('28-06-2015', 'Precluded (drone ship)', 1)]

## Author(s)
<h4> Moein (mrpintime) </h4>

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>